book/javascript全栈教程.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>javascript全栈教程.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/book/go%e8%af%ad%e8%a8%80%e7%bc%96%e7%a8%8b.org.html">Prev: go语言编程.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/book">Up: book</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/book/rich-dad-and-poor-dad.org.html">Next: rich-dad-and-poor-dad.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="一句话">一句话</h1>
<p>javascript 是浏览器中的解释型语言</p>
<h1 id="历史">历史</h1>
<ol class="incremental">
<li>网景 navigator 语言</li>
<li>微软 jscript</li>
<li>ecmascript 标准, 2015 年 6 月的 es6 标准</li>
</ol>
<h1 id="入门">入门</h1>
<h2 id="使用">使用</h2>
<p>通过 html 中 script 标签来引入，可存放于单独的文件，类型为 <code>text/javascipt</code></p>
<h2 id="类型">类型</h2>
<dl class="incremental">
<dt>Number</dt>
<dd>其中有 NaN 和 Infinity
</dd>
<dt>String</dt>
<dd>不可变
</dd>
<dt>Boolean</dt>
<dd>true 和 false，但逻辑假还有 null, undefined, "", false 等
</dd>
<dt>Array</dt>
<dd><code>[]</code> ， 关键方法 <code>splice</code>
</dd>
<dt>Object</dt>
<dd>键值必须为字符串
</dd>
<dt>Map</dt>
<dd>键值可以不限于字符串
</dd>
<dt>Set</dt>
<dd>集合
</dd>
</dl>
<h2 id="其它">其它</h2>
<h3 id="与"><code>==</code> 与 <code>===</code></h3>
<p>前者进行跨类型比较，后者同类型比较。用后者</p>
<h3 id="null-与-undefined">null 与 undefined</h3>
<p>前者为 void，后者为未定义？</p>
<h3 id="var-与-strict">var 与 strict</h3>
<p>var 定义的是本地变量，不加时为全局。应该要加。用 <code>"use strict"</code> 来强制检查</p>
<h3 id="backquote-与-interpolate">backquote 与 interpolate</h3>
<p>反引号同 python 中的 <code>```</code> ，其中可以用 ruby 的字符串模板语法</p>
<h3 id="in-与-hasownproperty">in 与 hasOwnProperty</h3>
<p>对象有继承自 Object 的方法，如 toString。使用 hasOwnProperty</p>
<h3 id="iterable">iterable</h3>
<p>Map, Set, Array 都是抽象的 iterable 类型</p>
<h3 id="for-in-与-for-of">for … in 与 for … of</h3>
<p>后者是更新的语法，严格对元素进行迭代。可以使用 <code>iterable.forEach</code> 方法回调</p>

      </div>
    </section>
  </body>
</html>
